/**
 * 
 */
/*
0 눈
1 간
2 장
3 피부
4 뼈
5 혈관
6 피로회복
    
    */ 
    
    const qnaList = [
        {
            q: '혈관 건강에 해당하는 것을 선탁하세요 ',
            a:[
            { answer: 'a. 상처가 잘 낫지 않아요', type: ['5']  },
            { answer: 'b. 잇몸이 붓고 피가 나요', type: ['5'
        ]},
            { answer: 'c. 선택할게 없어요', type: ['6', '6' ]},
            ]
        },
        {
            q: '소화/ 장 건강에 해당하는 것을 선택하세요',
            a:[
            { answer: 'a. 변비가 있어요', type: ['2']},
            { answer: 'b. 술을 마시면 얼굴이 붉어지고 소화가 안 돼요',type: ['1']},
            { answer: 'c. 선택할게 없어요', type: ['6']},
        ]
        },

        {
            q: '자신의 혈압의 상태에 해당하는 것을 선택하세요',
            a:[
            { answer: 'a. 혈압이 높아요 [140/90] 이상', type: ['2', '3', '2']},
            { answer: 'b. 혈압이 높아요 [140/90]',type: ['5','4'] },
            { answer: 'c. 선택할게 없어요', type: ['6'] },
            ]
        },

        {
        q: '운동을 얼마나 자주 하시나요?',
        a:[
            { answer: 'a. 주 4회 이상, 많이 해요!', type: ['0','4' ]},
            { answer: 'b. 주 2~3회, 적당히 해요!',  type: ['4'] },
            { answer: 'c. 주 1회 이하, 거의 하지 않아요', type: ['6']},
        ]
        },

        {
        q: '햇빛을 쬐는 야외 활동을 얼마나 하나요?',
        a:[
            { answer: 'a. 4시간 이상, 많이 해요!', type: ['6','3']},
            { answer: 'b. 1~4시간, 적당히 해요!', type: ['0', '3', '6']},
            { answer: 'c. 1시간 이하, 거의 하지 않아요', type: ['4']},
        ]
        },
    
        {
            q: '해당하는 식습관을 모두 선택하세요',
            a:[
                { answer: 'a. 생선을 자주 먹어요 주 3회 이상', type: ['3']},
                { answer: 'b. 채소를 자주 먹어요 주 3회 이상', type: ['3'] },
                { answer: 'c. 고기를 자주 먹어요 주 3회 이상',type: ['5']},
            ]
        },
        {
            q: '해당하는 기호식품 섭취 습관을 모두 선택하세요',
            a:[
                { answer: 'a. 담배를 피워요 하루 1/2갑 이상',  type: ['5', '3','0']},
            { answer: 'b. 커피를 마셔요 하루 3잔 이상',type: ['5', '6' ,'4']},
            { answer: 'c. 물을 잘 안 마셔요 맥주잔 4잔 이하', type: ['0','5','3']},
            ]
        },
        {
            q: '마지막 질문 입니다. 해당하는 것을 선택하세요',
            a:[
            { answer: 'a. 업무, 학업 강도가 높아요 하루 12시간 씩 주 2회 이상', type: ['0', '6' ]},
            { answer: 'b. 핸드폰, 모니터를 오래 봐요, 하루 6시간 이상', type: ['0','4' ]},
            { answer: 'c. 피부가 건조하거나, 최근에 나빠졌어요', type: ['3'] },
            ]
        },
    ]
    
    const infoList = [
        {
        name: '눈건강 관리에 주의하세요!',
        desc: '우리 신체 중 노화가 가장 빨리 찾아오는 기관이 눈입니다. 대표적인 눈질환에는 백내장, 녹내장, 당뇨망막병증, 나이관련 황반변성, 약시 등이 있습니다. 눈질환은 발병 초기 뚜렷한 자각증세가 없어 무엇보다 조기발견을 통한 사전 예방이 중요합니다.'
    
        },
        {
        name: '간건강 관리에 주의하세요!',
        desc: ' 간은 우리 몸의 혈액들이 들어가고 나가는 일종의 해독의 장기 입니다. 몸 전체 혈액은 한 번씩 다 간을 거쳐가게 되는데, 청소 되지 않은 독소가 남아있으면 간 질환에 걸리기 쉽습니다.'
        },
        {
        name: '장건강 관리에 주의하세요!',
        desc: '세균, 질병과 싸우는 힘인 면연력을 담당하는 곳이 바로 장입니다. 대장과 소장은 외부에서 유입된 음식물은 물론 세균과 같은 각종 이물질이 가장 오래 인체에 머물며 통과하는 곳이라 하는 중요한 기관 중 하나입니다.'
        },
        {
        name: ' 피부건강 관리에 주의하세요!',
        desc: '피부는 외부 환경과 직접 접촉하는 신체의 가장 바깥 조직으로서 자외선을 차단하고, 세균과 독소 등 위험 요소의 침입을 방지하며, 땀의 분비로 체온을 조절하고, 몸 안의 수분을 유지하는 등 다양한 생리적 기능을 담당하는 기관입니다.'
        },
        {
        name: ' 뼈건강 관리에 주의하세요!',
        desc: '뼈는 대뇌, 심장 및 기타 장기들을 외부 손상으로부터 보호합니다. 우리 몸의 뼈는 또한 칼슘과 인 성분과 같은 미량 원소들을 저장하여 뼈의 단단함을 유지하고 다른 용도로 인체가 필요할 때 방출합니다. '
        },

        {
        name: ' 혈관건강 관리에 주의하세요!',
        desc: '많은 양의 혈액이 전신을 돌며 필요한 영양분을 공급하고 노폐물을 제거해 줌으로써 우리가 살아가는 것이다. 그렇기 때문에 혈관이 건강하지 않으면 필요한 산소와 영양분이 충분히 공급되지 않아 신체 조직과 세포가 손상되고 치명적인 질병이 발생한다.'
        },
        {
        name: ' 피로회복 관리에 주의하세요!',
        desc: '피로가 제때 해소되지 않으면 우리 몸은 쌓인 피로와 새로운 일상의 피로를 감당하지 못하고 기능을 상실하는 지경에 이릅니다. 일상적인 문제에 대한 집중력과 주의력이 저하되어 업무 효율성과 학습 능력이 저하됩니다. 만성적인 과도한 피로는 또한 고혈압, 당뇨병, 우울증, 심지어 치매로 이어질 수 있습니다. 이렇듯 만성피로는 단순히 몸이 피곤하여 생활을 어렵게 만드는 문제가 아니라 각종 질병을 유발하는 심각한 문제입니다.'
        }
    ]